Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/faq-functions_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: faq-functions title: Passing Functions to Components permalink: docs/faq-functions.html layout: docs category: FAQ ---
ja: --- id: faq-functions title: コンポーネントに関数を渡す permalink: docs/faq-functions.html layout: docs category: FAQ ---

source: ### How do I pass an event handler (like onClick) to a component?
ja: ### コンポーネントに（onClick のような）イベントハンドラを渡すには？

source: Pass event handlers and other functions as props to child components:
ja: イベントハンドラやその他の関数を props として、子コンポーネントに渡してください。

source: If you need to have access to the parent component in the handler, you also need to bind the function to the component instance (see below).
ja: ハンドラ内で親コンポーネントにアクセスする必要がある場合は、関数をコンポーネントインスタンスにバインドする必要があります（以下を参照）。

source: ### How do I bind a function to a component instance?
ja: ### 関数をコンポーネントインスタンスにバインドするには？

source: There are several ways to make sure functions have access to component attributes like `this.props` and `this.state`, depending on which syntax and build steps you are using.
ja: 使用する構文やビルドステップにより、`this.props` や `this.state` のようなコンポーネントの属性に、関数がアクセスできるようにする方法がいくつかあります。

source: #### Bind in Constructor (ES2015) {#bind-in-constructor-es2015}
ja: #### コンストラクタでバインドする (ES2015) {#bind-in-constructor-es2015}

source: #### Class Properties (Stage 3 Proposal) {#class-properties-stage-3-proposal}
ja: #### クラスプロパティ (Stage 3 Proposal) {#class-properties-stage-3-proposal}

source: #### Bind in Render {#bind-in-render}
ja: #### レンダー内でバインドする {#bind-in-render}

source: >**Note:** > >Using `Function.prototype.bind` in render creates a new function each time the component renders, which may have performance implications (see below).
ja: > **補足：** > > レンダー内で `Function.prototype.bind` を利用すると、コンポーネントがレンダーされるたびに新しい関数が作成され、パフォーマンスに影響を与える可能性があります（下記参照）。

source: #### Arrow Function in Render {#arrow-function-in-render}
ja: #### レンダー内でアロー関数を使用する {#arrow-function-in-render}

source: >**Note:** > >Using an arrow function in render creates a new function each time the component renders, which may break optimizations based on strict identity comparison.
ja: > **注意：** > > レンダー内でアロー関数を利用するとコンポーネントがレンダーされるたびに新しい関数が作成されるため、厳密な一致による比較に基づいた最適化が動作しなくなる可能性があります。

source: ### Is it OK to use arrow functions in render methods?
ja: ### レンダー内でアロー関数を使用しても良いのか？

source: Generally speaking, yes, it is OK, and it is often the easiest way to pass parameters to callback functions.
ja: 一般的には問題ありません。コールバック関数にパラメータを渡すのに最も簡単な方法です。

source: If you do have performance issues, by all means, optimize!
ja: しかしパフォーマンス上の問題が出た際には、ぜひ最適化しましょう！

source: ### Why is binding necessary at all?
ja: ### そもそもバインドはなぜ必要なのか？

source: In JavaScript, these two code snippets are **not** equivalent:
ja: JavaScript において、以下の 2 つのコードは同等 **ではありません**。

source: Binding methods helps ensure that the second snippet works the same way as the first one.
ja: メソッドはバインドすることで、2 つ目のコードが 1 つ目と同様に動作するようになります。

source: With React, typically you only need to bind the methods you *pass* to other components.
ja: React では、一般的に他のコンポーネントに *渡す* メソッドしかバインドする必要はありません。

source: For example, `<button onClick={this.handleClick}>` passes `this.handleClick` so you want to bind it.
ja: たとえば、`<button onClick={this.handleClick}>` というコードは、`this.handleClick` を渡しているので、バインドする必要があります。

source: However, it is unnecessary to bind the `render` method or the lifecycle methods: we don't pass them to other components.
ja: しかし、`render` メソッドやライフサイクルメソッドをバインドする必要はありません。それらは他のコンポーネントに渡すことがないからです。

source: [This post by Yehuda Katz](https://yehudakatz.com/2011/08/11/understanding-javascript-function-invocation-and-this/) explains what binding is, and how functions work in JavaScript, in detail.
ja: [Yehuda Katz の記事](https://yehudakatz.com/2011/08/11/understanding-javascript-function-invocation-and-this/) はバインドとは何か、また JavaScript における関数の動作について詳細に説明してくれています。

source: ### Why is my function being called every time the component renders?
ja: ### どうしてコンポーネントをレンダーするたびに、関数が呼ばれるのか？

source: Make sure you aren't _calling the function_ when you pass it to the component:
ja: 関数をコンポーネントに渡すときにその関数を*呼び出していない*ことを確認してください：

source: Instead, *pass the function itself* (without parens):
ja: 代わりに、（カッコなしの）*関数自体を返すようにしてください*：

source: ### How do I pass a parameter to an event handler or callback?
ja: ### イベントハンドラやコールバックにパラメータを渡すには？

source: You can use an arrow function to wrap around an event handler and pass parameters:
ja: イベントハンドラをラップするアロー関数を作成してパラメータを渡すことができます：

source: This is equivalent to calling `.bind`:
ja: これは `.bind` を呼び出すのと同じことです：

source: #### Example: Passing params using arrow functions {#example-passing-params-using-arrow-functions}
ja: #### 例：アロー関数を利用してパラメータを渡す {#example-passing-params-using-arrow-functions}

source: #### Example: Passing params using data-attributes {#example-passing-params-using-data-attributes}
ja: #### 例：データ属性を利用してパラメータを渡す {#example-passing-params-using-data-attributes}

source: Alternately, you can use DOM APIs to store data needed for event handlers.
ja: ほかにも、DOM API をイベントハンドラに必要なデータの保存に使用することができます。

source: Consider this approach if you need to optimize a large number of elements or have a render tree that relies on React.PureComponent equality checks.
ja: 大量の要素を最適化したり、React.PureComponent による等価性チェックに依存したレンダーツリーがある場合に、この方法を検討してください。

source: ### How can I prevent a function from being called too quickly or too many times in a row?
ja: ### 関数があまりに頻繁にあるいは連続して呼ばれる場合の対処法は？

source: If you have an event handler such as `onClick` or `onScroll` and want to prevent the callback from being fired too quickly, then you can limit the rate at which callback is executed.
ja: `onClick` や `onScroll` のようなイベントハンドラがあって、それが高頻度で呼び出されるのを防ぎたい場合、コールバックが実行される頻度を制御するこができます。

source: This can be done by using:
ja: これは以下の方法で可能です：

source: - **throttling**: sample changes based on a time based frequency (eg [`_.throttle`](https://lodash.com/docs#throttle)) - **debouncing**: publish changes after a period of inactivity (eg [`_.debounce`](https://lodash.com/docs#debounce)) - **`requestAnimationFrame` throttling**: sample changes based on [`requestAnimationFrame`](https://developer.mozilla.org/en-US/docs/Web/API/window/requestAnimationFrame) (eg [`raf-schd`](https://github.com/alexreardon/raf-schd))
ja: - **スロットル**：時間ベースの頻度に基づくサンプルの制御（例：[`_.throttle`](https://lodash.com/docs#throttle)） - **デバウンス**：一定時間アクティブでなかった場合の出力の制御（例：[`_.debounce`](https://lodash.com/docs#debounce)) - **`requestAnimationFrame` スロットル**：[`requestAnimationFrame`](https://developer.mozilla.org/en-US/docs/Web/API/window/requestAnimationFrame) に基づくサンプルの制御 (例：[`raf-schd`](https://github.com/alexreardon/raf-schd))

source: See [this visualization](http://demo.nimius.net/debounce_throttle/) for a comparison of `throttle` and `debounce` functions.
ja: スロットルとデバウンスの比較は[このビジュアルデモ](http://demo.nimius.net/debounce_throttle/) をご覧ください。

source: > Note: > > `_.debounce`, `_.throttle` and `raf-schd` provide a `cancel` method to cancel delayed callbacks.
ja: > 補足： > > `_.debounce`、`_.throttle`、`raf-schd` は遅延されるコールバックの呼び出しをキャンセルするための `cancel` メソッドを提供します。

source: You should either call this method from `componentWillUnmount` _or_ check to ensure that the component is still mounted within the delayed function.
ja: `componentWillUnmount` でこのキャンセルメソッドを呼び出すか、*あるいは*遅延されるコールバック関数内でコンポーネントがまだマウントされていることを確認するようにしてください。

source: #### Throttle {#throttle}
ja: #### スロットル {#throttle}

source: Throttling prevents a function from being called more than once in a given window of time.
ja: スロットルは、特定の時間枠内に関数が複数回呼ばれるのを防ぎます。

source: The example below throttles a "click" handler to prevent calling it more than once per second.
ja: 以下の例では、「クリック」ハンドラをスロットルして、1 秒間に 2 回以上呼ばれるのを防ぎます。

source: #### Debounce {#debounce}
ja: #### デバウンス {#debounce}

source: Debouncing ensures that a function will not be executed until after a certain amount of time has passed since it was last called.
ja: デバウンスは、関数が最後に呼ばれてから一定時間経過するまで実行されないようにします。

source: This can be useful when you have to perform some expensive calculation in response to an event that might dispatch rapidly (eg scroll or keyboard events).
ja: これは、高頻度で発生するイベント（例：スクロールやキーボードイベントなど）に応じた高コストな計算処理が必要なときに役立ちます。

source: The example below debounces text input with a 250ms delay.
ja: 下記の例は、250 ミリ秒の遅延でテキスト入力をデバウンスします。

source: #### `requestAnimationFrame` throttling {#requestanimationframe-throttling}
ja: #### `requestAnimationFrame` スロットル {#requestanimationframe-throttling}

source: [`requestAnimationFrame`](https://developer.mozilla.org/en-US/docs/Web/API/window/requestAnimationFrame) is a way of queuing a function to be executed in the browser at the optimal time for rendering performance.
ja: [`requestAnimationFrame`](https://developer.mozilla.org/en-US/docs/Web/API/window/requestAnimationFrame) は描画パフォーマンスが最適化されるタイミングでブラウザで実行される関数をキューに入れる方法です。

source: A function that is queued with `requestAnimationFrame` will fire in the next frame.
ja: `requerstAnimationFrame` でキューに入れられている関数は、次のフレームで実行されます。

source: The browser will work hard to ensure that there are 60 frames per second (60 fps).
ja: ブラウザは、毎秒 60 フレーム (60fps) を確保するように努めます。

source: However, if the browser is unable to it will naturally *limit* the amount of frames in a second.
ja: しかし、それができなかった場合には、自然に 1 秒間のフレーム数が *制限* されます。

source: For example, a device might only be able to handle 30 fps and so you will only get 30 frames in that second.
ja: たとえば、デバイスが 30 fps しか処理できなければ、1 秒間に 30 フレームしか取得できません。

source: Using `requestAnimationFrame` for throttling is a useful technique in that it prevents you from doing more than 60 updates in a second.
ja: `requestAnimationFrame` スロットルを使うことで、1 秒間に 60 回以上になる更新を防ぐことができます。

source: If you are doing 100 updates in a second this creates additional work for the browser that the user will not see anyway.
ja: 1 秒間に 100 回の更新をする場合、ユーザには確認できない追加作業をブラウザが作成することになります。

source: >**Note:** > >Using this technique will only capture the last published value in a frame.
ja: > **注意：** > > このテクニックにより、フレーム内の最後に公開された値のみがキャプチャされます。

source: You can see an example of how this optimization works on [`MDN`](https://developer.mozilla.org/en-US/docs/Web/Events/scroll)
ja: この最適化がどのように動作するのかについての例は [`MDN`](https://developer.mozilla.org/en-US/docs/Web/Events/scroll) で確認できます。

source: #### Testing your rate limiting {#testing-your-rate-limiting}
ja: #### レート制限をテストする {#testing-your-rate-limiting}

source: When testing your rate limiting code works correctly it is helpful to have the ability to fast forward time.
ja: レート制限コードを正しくテストするとき、早送り機能があると便利です。

source: If you are using [`jest`](https://facebook.github.io/jest/) then you can use [`mock timers`](https://facebook.github.io/jest/docs/en/timer-mocks.html) to fast forward time.
ja: もし [`jest`](https://facebook.github.io/jest/) を使っているのであれば、[`mock timers`](https://facebook.github.io/jest/docs/en/timer-mocks.html) を使って時間を早送りすることができます。

source: If you are using `requestAnimationFrame` throttling then you may find [`raf-stub`](https://github.com/alexreardon/raf-stub) to be a useful tool to control the ticking of animation frames.
ja: `requestAnimationFrame` スロットルを使っているのであれば、[`raf-stub`](https://github.com/alexreardon/raf-stub) がアニメーションフレームの間隔を制御するのに役立つでしょう。
